app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "14"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "this is my cooment on ur post"], ["commenter", "me"], ["created_at", Tue, 19 Nov 2013 09:34:39 UTC +00:00], ["post_id", 14], ["updated_at", Tue, 19 Nov 2013 09:34:39 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])