app/controllers/indo_posts_controller.rb

SELECT "indo_posts".* FROM "indo_posts"
---
  def index
    @indo_posts = IndoPost.all

SELECT "indo_posts".* FROM "indo_posts" WHERE "indo_posts"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @indo_post = IndoPost.find(params[:id])

SELECT "indo_posts".* FROM "indo_posts" WHERE "indo_posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "indo_posts" SET "date" = 'date', "location" = 'location', "content" = 'content', "updated_at" = '2014-03-19 00:46:41.276967' WHERE "indo_posts"."id" = 1
---
  def update
    @indo_post = IndoPost.find(params[:id])
    if @indo_post.update_attributes(params[:indo_post])

SELECT "indo_posts".* FROM "indo_posts" WHERE "indo_posts"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @indo_post = IndoPost.find(params[:id])

INSERT INTO "indo_posts" ("content", "created_at", "date", "location", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @indo_post = IndoPost.new(params[:indo_post])
    if @indo_post.save