app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = 'try this again with edit', "updated_at" = '2013-11-19 09:24:21.330188' WHERE "posts"."id" = 11

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Trial post\r\n"], ["created_at", Tue, 19 Nov 2013 06:21:25 UTC +00:00], ["title", "Trial"], ["updated_at", Tue, 19 Nov 2013 06:21:25 UTC +00:00]]